Plan was tested on s3-data-archive stack in YL. 

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply"
which may have affected this plan:

```
  # module.s3.aws_iam_policy.ro[0] has changed
  # (moved from module.s3.aws_iam_policy.ro)
  ~ resource "aws_iam_policy" "ro" {
        id          = "arn:aws:iam::624833702999:policy/terraform/624833702999-data-archive-read-only"
        name        = "624833702999-data-archive-read-only"
      + tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.s3.aws_iam_policy.rw[0] has changed
  # (moved from module.s3.aws_iam_policy.rw)
  ~ resource "aws_iam_policy" "rw" {
        id          = "arn:aws:iam::624833702999:policy/terraform/624833702999-data-archive-read-write"
        name        = "624833702999-data-archive-read-write"
      + tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.s3.aws_s3_bucket.s3[0] has changed
  # (moved from module.s3.aws_s3_bucket.s3)
  ~ resource "aws_s3_bucket" "s3" {
        id                          = "624833702999-data-archive"
      + tags                        = {}
        # (11 unchanged attributes hidden)

      + grant {
          + id          = "953f424b40630c83e99aab348062a0a6be922ea879f6b1d94bbfdf3918ea00ed"
          + permissions = [
              + "FULL_CONTROL",
            ]
          + type        = "CanonicalUser"
        }


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes
using ignore_changes, the following plan may include actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions
are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.s3.aws_iam_policy.ro[0] must be replaced
  # (moved from module.s3.aws_iam_policy.ro)
-/+ resource "aws_iam_policy" "ro" {
      ~ arn         = "arn:aws:iam::624833702999:policy/terraform/624833702999-data-archive-read-only" -> (known after apply)
      ~ id          = "arn:aws:iam::624833702999:policy/terraform/624833702999-data-archive-read-only" -> (known after apply)
        name        = "624833702999-data-archive-read-only"
      ~ path        = "/terraform/" -> "/" # forces replacement
      ~ policy      = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action   = [
                            "s3:GetObjectAcl",
                            "s3:GetObject",
                            "s3:ListBucket",
                            "s3:GetBucketLocation",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::624833702999-data-archive",
                            "arn:aws:s3:::624833702999-data-archive/*",
                        ]
                        Sid      = "ReadOnly"
                    },
                    {
                        Action   = "s3:ListBucket"
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::624833702999-data-archive"
                        Sid      = "List"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ policy_id   = "ANPAZC6X5VRLUHT5O6CUM" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.s3.aws_iam_policy.rw[0] must be replaced
  # (moved from module.s3.aws_iam_policy.rw)
-/+ resource "aws_iam_policy" "rw" {
      ~ arn         = "arn:aws:iam::624833702999:policy/terraform/624833702999-data-archive-read-write" -> (known after apply)
      ~ id          = "arn:aws:iam::624833702999:policy/terraform/624833702999-data-archive-read-write" -> (known after apply)
        name        = "624833702999-data-archive-read-write"
      ~ path        = "/terraform/" -> "/" # forces replacement
      ~ policy      = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:PutObjectAcl",
                            "s3:GetObjectAcl",
                            "s3:GetObject",
                            "s3:ListBucket",
                            "s3:DeleteObject",
                            "s3:GetBucketLocation",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::624833702999-data-archive",
                            "arn:aws:s3:::624833702999-data-archive/*",
                        ]
                        Sid      = "ReadWrite"
                    },
                    {
                        Action   = "s3:ListBucket"
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::624833702999-data-archive"
                        Sid      = "List"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ policy_id   = "ANPAZC6X5VRL3CY7E3QEV" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.s3.aws_s3_bucket.s3 has moved to module.s3.aws_s3_bucket.s3[0]
    resource "aws_s3_bucket" "s3" {
        id                          = "624833702999-data-archive"
        tags                        = {}
        # (11 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.s3.aws_s3_bucket_public_access_block.s3 has moved to module.s3.aws_s3_bucket_public_access_block.s3[0]
    resource "aws_s3_bucket_public_access_block" "s3" {
        id                      = "624833702999-data-archive"
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.s3.aws_s3_bucket.s3,
│   on .terraform/modules/s3/main.tf line 12, in resource "aws_s3_bucket" "s3":
│   12: resource "aws_s3_bucket" "s3" {
│ 
│ Use the aws_s3_bucket_versioning resource instead
│ 
│ (and 7 more similar warnings elsewhere)
```